package day64.객체연관관계;

public class main {
    // 회원 객체와 게시물 객체와 댓글 객체 관계
    public static void main(String[] args) {

        // ========= 단(한 방향에서만 참조 중) 방향 연관관계, PK --- FK 관계, 1 : n 관계 ========= //

        // 1. '강호동' 회원 가입 진행
        회원 m1 = 회원.builder().회원번호(1).회원아이디("qwe").회원이름("강호동").build();
            // 빌더 패턴을 이용한 인스턴스 생성 vs 생성자 인스턴스 생성
        // 회원 m2 = new 회원(1, "qwe", "강호동");

        // 2. '강호동' 회원이 게시물 작성
        게시물 b1 = 게시물.builder().게시물번호(1).게시물제목("강호동이 쓴 글").게시물내용("안녕").build();
        // + 회원(강호동)이 게시물을 작성하게 관계를 하기 위해서 두 객체는 어떻게 관계 표현?
        // 회원[상위]PK <---> 게시물[하위]FK
        b1.set게시물작성자FK(m1); // 회원 객체를 게시물 객체에 대입한다.

        // 3. 1번 게시물의 작성자 확인, 게시물의 객체만으로 회원 객체의 정보를 알 수 있다.
        System.out.println("1번 게시물의 작성자 아이디 : " + b1.get게시물작성자FK().get회원아이디());
        System.out.println("1번 게시물의 작성자 이름 : " + b1.get게시물작성자FK().get회원이름());

        // 4. 회원 객체의 게시물 확인, 게시물 객체는 회원객체를 참조하지만 회원 객체는 게시물 객체를 참조하지 않는다.
        //System.out.println("강호동의 게시물 확인 : " + m1.????);

        // ========= 양방향 (서로 참조) 연관관계, 데이터베이스에서는 표현 불가능하다. ========= //
        // 5. 양방향 설정, 회원객체에 게시물 객체 대입
        m1.get작성한게시물().add(b1); // m1(강호동)객체에 b1(게시물)객체를 대입

        System.out.println(m1);
        // @ToString 사용하지 않았을 때 : day64.객체연관관계.회원@3a71f4dd
        // @ToString, @ToString.Exclude : 회원(회원번호=1, 회원아이디=qwe, 회원이름=강호동)
    }
}
